cf_billing/InformationRegisters/бестДатыОтчетногоПериодыОбщиеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестДатыОтчетногоПериодыОбщиеНастройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Завершение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/CommonModules/бестНачисленияНП/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура - Начислить.
// Создание документа бестНачислениеНП.
//
// Параметры:
//  Параметры		-	Структура:
//							* Организация				-	СправочникСсылка.Организации.
//							* Район						-	СправочникСсылка.энргЗоныОтвественности.
//							* ПериодНачисления			-	Дата.
//							* МКД_НП					-	СправочникСсылка.энргСтроения.
//							* ИсключаяОтдельностоящие	-	Булево.
//  мОбъектыРасчета	-	Массив значений типа СправочникСсылка.бестОбъектыРасчета.
//  Документ		-	ДокументСсылка.бестНачислениеНП.
//
Процедура Начислить(Параметры,мОбъектыРасчета = Неопределено,Документ  = Неопределено) Экспорт
	
	Инструменты = бестЗащитаСерверПовтИсп.ИнструментыНачисленийНП();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект"; 
		Возврат;
	КонецЕсли; 
	Инструменты.Начислить(Параметры.Организация, Параметры.ПериодНачисления, Параметры.Район,Параметры.МКД_НП,Параметры.ИсключаяОтдельностоящие,мОбъектыРасчета,Документ);
	
КонецПроцедуры

// Процедура - Начисления по долевым схемам.
// Создание документа бестНачислениеПоДолевымСхемам.
//
// Параметры:
//  Параметры	-	Структура см. в процедуре выше.
//  Договор		-	СправочникСсылка.энргДоговорыКонтрагентов.
//  Документ	-	ДокументСсылка.бестНачислениеПоДолевымСхемам.
//  РазныеРО	-	Булево.
//
Процедура НачисленияПоДолевымСхемам(Параметры,Договор = Неопределено,Документ  = Неопределено, РазныеРО = Ложь) Экспорт
	
	Инструменты = бестЗащитаСерверПовтИсп.ИнструментыНачисленийНП();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект"; 
		Возврат;
	КонецЕсли; 
	Инструменты.НачисленияПоДолевымСхемам(Параметры.Организация, Параметры.ПериодНачисления, Параметры.Район,
		Параметры.МКД_НП, Параметры.ИсключаяОтдельностоящие, Договор, Документ, РазныеРО);
	
КонецПроцедуры

// Процедура - Начислить пеню.
// Создание документа бестНачислениеПениНП.
//
// Параметры:
//  Организация				-	СправочникСсылка.Организации.
//  ПериодНачисления		-	Дата.
//  Район					-	СправочникСсылка.энргЗоныОтвественности.
//  МКД						-	СправочникСсылка.энргСтроения.
//  ИсключаяОтдельностоящие	-	Булево.
//  Договор					-	СправочникСсылка.энргДоговорыКонтрагентов.
//  Документ				-	ДокументСсылка.бестНачислениеПениНП.
//
Процедура НачислитьПеню(Организация, ПериодНачисления,Район,МКД = Неопределено,ИсключаяОтдельностоящие = Ложь,Договор = Неопределено,Документ  = Неопределено) Экспорт 
	
	Инструменты = бестЗащитаСерверПовтИсп.ИнструментыНачисленийНП();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.НачислитьПеню(Организация,ПериодНачисления,Район,МКД,ИсключаяОтдельностоящие,Договор, Документ);
	
КонецПроцедуры

// Процедура - Снять средние начисления НП.
// Создание документа бестПерерасчетНП и бестПерерасчетНПЭЭ.
//
// Параметры:
//  Параметры	-	Структура см. в процедуре выше.
//  Договор		-	СправочникСсылка.энргДоговорыКонтрагентов.
//  Документ	-	ДокументСсылка.бестПерерасчетНП, ДокументСсылка.бестПерерасчетНПЭЭ.
//
Процедура СнятьСредниеНачисленияНП(Параметры,Договор = Неопределено,Документ  = Неопределено) Экспорт 
	
	Инструменты = бестЗащитаСерверПовтИсп.ИнструментыНачисленийНП();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.СнятьСредниеНачисленияНП(Параметры.Организация,Параметры.ПериодНачисления,Параметры.Район,Параметры.МКД_НП,Параметры.ИсключаяОтдельностоящие,Договор, Документ);
	Инструменты.СнятьСредниеНачисленияНПЭЭ(Параметры.Организация,Параметры.ПериодНачисления,Параметры.Район,Параметры.МКД_НП,Параметры.ИсключаяОтдельностоящие,Документ);
	
КонецПроцедуры

// Процедура - Начисления по схемам структуры сети.
// Создание документа бестНачислениеПоСхемамСтруктурыСети.
//
// Параметры:
//  Параметры	-	Структура см. в процедуре выше.
//  Договор		-	СправочникСсылка.энргДоговорыКонтрагентов.
//  Документ	-	ДокументСсылка.бестНачислениеПоСхемамСтруктурыСети.
//
Процедура НачисленияПоСхемамСтруктурыСети(Параметры,Договор = Неопределено,Документ  = Неопределено) Экспорт
	Инструменты = бестЗащитаСерверПовтИсп.ИнструментыНачисленийНП();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.НачисленияПоСхемамСтруктурыСети(Параметры.Организация,Параметры.ПериодНачисления,Параметры.Район,Параметры.МКД_НП,Параметры.ИсключаяОтдельностоящие,Договор, Документ);
КонецПроцедуры

// Процедура - Дополнительные начисления ЮЛ.
// Создание документа бестДополнительныеНачисления.
//
// Параметры:
//  Параметры	-	Структура см. в процедуре выше.
//  Договор		-	СправочникСсылка.энргДоговорыКонтрагентов.
//  Документ	-	ДокументСсылка.бестДополнительныеНачисления.
//
Процедура ДополнительныеНачисленияЮЛ(Параметры,Договор = Неопределено,Документ  = Неопределено) Экспорт
	Инструменты = бестЗащитаСерверПовтИсп.ИнструментыНачисленийНП();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ДополнительныеНачисленияЮЛ(Параметры.Организация,Параметры.ПериодНачисления,Параметры.Район,Параметры.МКД_НП,Параметры.ИсключаяОтдельностоящие,Договор, Документ);
КонецПроцедуры

// Процедура - Данные перерасчета ЭЭ.
// Создание документа бестПерерасчетНПЭЭ.
//
// Параметры:
//  Организация				-	СправочникСсылка.Организации.
//  Район					-	СправочникСсылка.энргЗоныОтвественности.
//  ОснованиеПерерасчета	-	ДокументСсылка.бестПочасоваяВедомость, ДокументСсылка.бестИзменитьПараметрыТочкиУчета,
//		ДокументСсылка.бестОперацияСПриборомУчетаНП, ДокументСсылка.бестОперацияСУслугамиНП,
//		ДокументСсылка.бестЗаключениеДоговоровСЮридическимиЛицами, ДокументСсылка.бестРегистрацияПоказанийНП.
//  ПериодНачисления		-	Дата.
//  Набор					-	Движения.бестОбъемНачисленийЭлектроэнергии.
//  КорректируемыеПоказания	-	ДокументСсылка.бестРегистрацияПоказанийНП.
//
Процедура ДанныеПерерасчетаЭЭ(Организация, Район, ОснованиеПерерасчета, ПериодНачисления, Набор, КорректируемыеПоказания = Неопределено) Экспорт
	Инструменты = бестЗащитаСерверПовтИсп.ИнструментыНачисленийНП();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект"; 
		Возврат;
	КонецЕсли; 
	Инструменты.ДанныеПерерасчетаЭЭ(Организация, Район, ОснованиеПерерасчета, ПериодНачисления, Набор, КорректируемыеПоказания);
КонецПроцедуры	

// Функция - Начислить пеню ЭЭ.
// Создание документа бестПлатежныйДокумент.
//
// Параметры:
//  Организация			-	СправочникСсылка.Организации.
//  ПериодНачисления	-	Дата.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  Договор				-	СправочникСсылка.энргДоговорыКонтрагентов.
// 
// Возвращаемое значение:
//  Структура:
//		* КоличествоНеПроведенныхПД	-	Число.
//		* СозданныеДокументы		-	Массив.
//
Функция НачислитьПенюЭЭ(Организация, ПериодНачисления,Район,Договор = Неопределено) Экспорт 
	
	Инструменты = бестЗащитаСерверПовтИсп.ИнструментыНачисленийНП();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат Неопределено;
	КонецЕсли; 
	Возврат Инструменты.НачислитьПенюЭЭ(Организация,ПериодНачисления,Район,Договор);
	
КонецФункции

#Область ВспомогательныеФункции

// Записать наборы записей.
//
// Параметры:
//  СтруктураНаборов	-	Структура.
//
Процедура ЗаписатьНаборыЗаписей(СтруктураНаборов) Экспорт 
	
	Ключи = Новый СписокЗначений;
	Для Каждого КлючЗначение Из СтруктураНаборов Цикл
		Ключи.Добавить(КлючЗначение.Ключ);
	КонецЦикла;
	
	Ключи.СортироватьПоЗначению();
	
	Для Каждого СтрокаСписка Из Ключи Цикл
		СтруктураНаборов[СтрокаСписка.Значение].Записать();
	КонецЦикла;	
	
КонецПроцедуры

// Сформировать строку для запроса.
//
// Параметры:
//  ИмяРегистра		-	Строка	-	имя регистра накопления, для которого формируется строка запроса.
//  ИмяТаблицы		-	Строка	-	имя таблицы в запросе.
//  ИсключаемыеПоля	-	Строка	-	список полей, разделенных запятой, которые нужно исключить из результата.
//  ПерваяСтрока	-	Булево	-	флаг, указывающий что это первая строка в списке полей.
//  ПоследняяСтрока	-	Булево	-	флаг, указывающий что это последняя строка в списке полей.
//  ЭтоГруппировка	-	Булево	-	флаг, указывающий что строка формируется для раздела СГРУППИРОВАТЬ ПО.
// 
// Возвращаемое значение:
//  Строка	-	строка для использования в запросе.
//
Функция СформироватьСтрокуДляЗапроса(ИмяРегистра,ИмяТаблицы,ИсключаемыеПоля,ПерваяСтрока = Ложь, ПоследняяСтрока = Истина ,ЭтоГруппировка = ложь) Экспорт
	
	ОписаниеТаблицы = бестНачисленияНП.ИзмеренияТаблицыОбъемов(ИмяРегистра); 
	
	ПоляИсключая 	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключаемыеПоля,,Истина);
	ПоляИзмерений 	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОписаниеТаблицы.Измерения,,Истина);
	ПоляРесурсов	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОписаниеТаблицы.Ресурсы,,Истина);
	
	Если ПерваяСтрока Тогда
		Сч 			= 0;
	Иначе
		Сч 			= 1;
	КонецЕсли;

	Результат  		= "";
	Для Каждого Поле Из ПоляИзмерений Цикл
		Если НЕ ПоляИсключая.Найти(Поле) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Результат 	= Результат + ?(Сч > 0, Символы.ПС,"") + ИмяТаблицы + "." + Поле + ?(Не ЭтоГруппировка, " КАК " + Поле + ",", ","); 
		Сч 			= Сч + 1;		
	КонецЦикла;	
	
	Для Каждого Поле Из ПоляРесурсов Цикл
		Если НЕ ПоляИсключая.Найти(Поле) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Результат 	= Результат + ?(Сч > 0, Символы.ПС,"") + ИмяТаблицы + "." + Поле + ?(Не ЭтоГруппировка, " КАК " + Поле + ",", ","); 
		Сч 			= Сч + 1;		
	КонецЦикла;
	
	Если ПоследняяСтрока Тогда
		Результат 	= Лев(Результат, СтрДлина(Результат) - 1);
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

// Описание таблицы объемов.
//
// Параметры:
//  ИмяРегистра		-	Строка	-	имя регистра накопления, для которого требуется получить описание таблицы.
// 
// Возвращаемое значение:
//	 ТаблицаЗначений	-	состоит из измерений, ресурсов и реквизитов указанного регистра.
//
Функция ОписаниеТаблицыОбъемов(ИмяРегистра = "бестОбъемНачисленийНП") Экспорт 		
	Возврат бестНачисленияПовтИспНП.ОписаниеТаблицыОбъемов(ИмяРегистра);	
КонецФункции

// Измерения таблицы объемов.
//
// Параметры:
//  ИмяРегистра	-	Строка	-	имя регистра, для которого требуется получить измерения, ресурсы и реквизиты.
// 
// Возвращаемое значение:
//	 Структура	-	см. бестНачисленияПовтИспНП.ИзмеренияТаблицыОбъемов.
//
Функция ИзмеренияТаблицыОбъемов(ИмяРегистра = "бестОбъемНачисленийНП") Экспорт		
	Возврат бестНачисленияПовтИспНП.ИзмеренияТаблицыОбъемов(ИмяРегистра);		
КонецФункции

// Описание документа начисления.
//
// Параметры:
//  ИмяДокумента-	Строка	-	имя документа, для которого требуется получить описание.
// 
// Возвращаемое значение:
//	 Структура.
//
Функция ОписаниеДокументаНачисления(ИмяДокумента) Экспорт 
	
	Описание 			= Новый Структура;
	
	МетаданныеДокумета  = Метаданные.Документы[ИмяДокумента];
	
	для Каждого Реквизит из МетаданныеДокумета.Реквизиты цикл
		Описание.Вставить(Реквизит.имя);
	КонецЦикла;
	
	Для Каждого ТабЧасть из МетаданныеДокумета.ТабличныеЧасти цикл
		
		ТаблицаТЧ		= Новый ТаблицаЗначений;
		
		для Каждого РеквизитТЧ из ТабЧасть.реквизиты цикл
			ТаблицаТЧ.Колонки.Добавить(РеквизитТЧ.Имя,РеквизитТЧ.тип);
		КонецЦикла;
		Описание.Вставить(ТабЧасть.имя,ТаблицаТЧ);
	КонецЦикла;
	
	Возврат Описание;	
КонецФункции

// Типы коэффициентов в формулах расчета.
// 
// Возвращаемое значение:
//  Структура	-	см. бестНачисленияПовтИспНП.ТипыКоэффициентовВФормулахРасчета.
//
Функция ТипыКоэффициентовВФормулахРасчета() Экспорт
	Возврат бестНачисленияПовтИспНП.ТипыКоэффициентовВФормулахРасчета();
КонецФункции

// Текст границ отчетного периода.
//
// Параметры:
//  НачПерНач					-	Дата	-	дата начала периода.
//  КонПерНач					-	Дата	-	дата начала периода.
//  УчитыватьНачалоВеденияУчета	-	Булево	-	флаг, указывающий необходимость учета даты начала ведения учета.
// 
// Возвращаемое значение:
//  Строка	-	текст запроса формирующий таблицу с границами отчетных периодов.
//
Функция ТекстГраницОтчетногоПериода(НачПерНач,КонПерНач,УчитыватьНачалоВеденияУчета = ложь) Экспорт
	Нач				= НачПерНач; 	
	
	Шаблон 			=
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ), ДЕНЬ, ВЫБОР
	|			КОГДА бестДатыОтчетногоПериодыОбщиеНастройки.Завершение = 31
	|				ТОГДА ДЕНЬ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ПериодНачисления, МЕСЯЦ), СЕКУНДА, -1))
	|			ИНАЧЕ бестДатыОтчетногоПериодыОбщиеНастройки.Завершение
	|		КОНЕЦ) КАК НачалоОП,
	|	ДОБАВИТЬКДАТЕ(&ПериодНачисления, ДЕНЬ, ВЫБОР
	|			КОГДА бестДатыОтчетногоПериодыОбщиеНастройки.Завершение = 31
	|				ТОГДА ДЕНЬ(КОНЕЦПЕРИОДА(&ПериодНачисления, МЕСЯЦ))
	|			ИНАЧЕ бестДатыОтчетногоПериодыОбщиеНастройки.Завершение
	|		КОНЕЦ) КАК ЗавершениеОП,
	|	РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ), ДЕНЬ, ВЫБОР
	|				КОГДА бестДатыОтчетногоПериодыОбщиеНастройки.Завершение = 31
	|					ТОГДА ДЕНЬ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ПериодНачисления, МЕСЯЦ), СЕКУНДА, -1))
	|				ИНАЧЕ бестДатыОтчетногоПериодыОбщиеНастройки.Завершение
	|			КОНЕЦ), ДОБАВИТЬКДАТЕ(&ПериодНачисления, ДЕНЬ, ВЫБОР
	|				КОГДА бестДатыОтчетногоПериодыОбщиеНастройки.Завершение = 31
	|					ТОГДА ДЕНЬ(КОНЕЦПЕРИОДА(&ПериодНачисления, МЕСЯЦ))
	|				ИНАЧЕ бестДатыОтчетногоПериодыОбщиеНастройки.Завершение
	|			КОНЕЦ), ДЕНЬ) КАК ДнейВПериоде
	|ИЗ
	|	(ВЫБРАТЬ
	|		бестДатыОтчетногоПериодыОбщиеНастройки.Завершение КАК Завершение
	|	ИЗ
	|		РегистрСведений.бестДатыОтчетногоПериодыОбщиеНастройки КАК бестДатыОтчетногоПериодыОбщиеНастройки
	|	ГДЕ
	|		бестДатыОтчетногоПериодыОбщиеНастройки.Организация = &Организация) КАК бестДатыОтчетногоПериодыОбщиеНастройки";
	Текст 				= "";
	Сч					= 0;
	Пока Истина цикл
		Если  Нач >КонПерНач тогда
			Прервать;;
		КонецЕсли;
		СтрокаПериода 		= "ДАТАВРЕМЯ(" +СтрЗаменить(СтрЗаменить(Год(Нач)," ",""),Символы.НПП,"") + "," + СтрЗаменить(СтрЗаменить(МЕСЯЦ(Нач)," ",""),Символы.НПП,"") + "," +  СтрЗаменить(СтрЗаменить(ДЕНЬ(Нач)," ",""),Символы.НПП,"") + ")";
		
		Если Сч> 0 тогда
			Текст 			= Текст + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" +Символы.ПС; 						
		КонецЕсли;
		
		Текст 				= Текст + СтрЗаменить(Шаблон,"&ПериодНачисления",СтрокаПериода);
		Если Сч = 0 тогда
			Текст 			= СтрЗаменить(Текст,"%%ФормируемВременную%%","ПОМЕСТИТЬ ГраницыОтчетногоПериода");
		иначе 
			Текст 			= СтрЗаменить(Текст,"%%ФормируемВременную%%",""); 						
		КонецЕсли;		
		Сч 					= Сч + 1;
		Нач 				= ДобавитьМесяц(Нач,1);
	КонецЦикла;
	
	Если УчитыватьНачалоВеденияУчета тогда
		НачалоВеденияУчета 	= энргОбщегоНазначения.ЗначениеКонстанты("энргДатаНачалаВеденияУчета");
		Если ЗначениеЗаполнено(НачалоВеденияУчета) тогда
			Год 			= СтрЗаменить(Год(НачалоВеденияУчета),Символы.НПП,"");
			Месяц 			= СтрЗаменить(Месяц(НачалоВеденияУчета),Символы.НПП,"");
			День 			= СтрЗаменить(День(НачалоВеденияУчета),Символы.НПП,"");
			СтрокаЗапроса  	= "ДАТАВРЕМЯ(" + Год + "," + Месяц + "," + День + ")";
			СтрокаПоиска	= "" +СтрокаЗапроса +" КАК ПериодНачисления,
			|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(" + СтрокаЗапроса + ", СЕКУНДА, -1), МЕСЯЦ), ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеПредыдущего, бестДатыОтчетногоПериодыОбщиеНастройки.Завершение)) КАК НачалоОП,
			|	ДОБАВИТЬКДАТЕ("+СтрокаЗапроса+", ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеТекущего, бестДатыОтчетногоПериодыОбщиеНастройки.Завершение)) КАК ЗавершениеОП,
			|	РазностьДат(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ("+СтрокаЗапроса+", СЕКУНДА, -1), МЕСЯЦ), ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеПредыдущего, бестДатыОтчетногоПериодыОбщиеНастройки.Завершение)),ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ("+СтрокаЗапроса+", ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеТекущего, бестДатыОтчетногоПериодыОбщиеНастройки.Завершение)), СЕКУНДА, -1),День)+1  КАК ДнейВПериоде";
			
			СтрокаЗамены 	= "" + СтрокаЗапроса +" КАК ПериодНачисления,
			|	" + СтрокаЗапроса +" КАК НачалоОП,
			|	ДОБАВИТЬКДАТЕ("+СтрокаЗапроса+", ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеТекущего, бестДатыОтчетногоПериодыОбщиеНастройки.Завершение)) как ЗавершениеОП,
			|	РазностьДат(" + СтрокаЗапроса +",ДОБАВИТЬКДАТЕ("+СтрокаЗапроса+", ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеТекущего, бестДатыОтчетногоПериодыОбщиеНастройки.Завершение)),ДЕНЬ)  КАК ДнейВПериоде";
			
			Текст 			= СтрЗаменить(Текст,СтрокаПоиска,СтрокаЗамены);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти
